<template>
  <v-row justify="center">
    <v-dialog v-model="conditionsDialog" max-width="600">
      <v-card id="conditionsModal">
        <div class="close-icon">
          <v-icon class="icon" @click="conditionsDialog = false"
            >mdi-close-circle</v-icon
          >
        </div>
        <v-card-title>
          <span class="headline">Terms & Conditions</span>
        </v-card-title>
        <v-card-text>
          Terms & Conditions เงื่อนไขการให้บริการข้อกำหนด &
          เงื่อนไขนโยบายการคุ้มครองสิทธิประโยชน์ & ผลตอบแทนการส่ง &
          การส่งมอบคำถามที่ถามบ่อยเกี่ยวกับเรา ก่อนที่จะใช้บริการของเรา
          เราขอให้คุณอ่านข้อกำหนดและเงื่อนไขของเรา
          เมื่อลงทะเบียนบัญชีบนเว็บไซต์ของ boxza.co.th คุณ ("ผู้ใช้")
          ยอมรับและตกลงที่จะปฏิบัติตามข้อกำหนดและเงื่อนไขเหล่านี้
          ดังนั้นสำหรับเอกสารที่อ้างถึงในนั้น
          หากคุณไม่ยอมรับข้อกำหนดและเงื่อนไขเหล่านี้คุณไม่ควรใช้เว็บไซต์หรือบริการ
          เงื่อนไขการใช้บริการ หากคุณต้องการใช้เว็บไซต์ boxza.co.th
          คุณควรมีอายุเกินสิบแปดปี (18) ในการเข้าถึงเว็บไซต์คุณต้องมีเดสก์ท็อป
          หรือเบราว์เซอร์มือถือ หากคุณมีปัญหาใด ๆ
          ในขณะที่เปิดเว็บเพจหรือใช้บริการของเราโปรดดาวน์โหลดเว็บเบราว์เซอร์ที่รองรับหรืออัปเดตเป็นเวอร์ชันล่าสุด
          คุณยอมรับและยอมรับความจริงที่ว่าประสิทธิภาพของบริการขึ้นอยู่กับประสิทธิภาพของอุปกรณ์ที่คุณใช้และคุณภาพของการเชื่อมต่ออินเทอร์เน็ตของคุณ
          คุณตกลงที่จะลงทะเบียนและลงทะเบียนที่บริการ boxza.co.th ผ่านบัญชี
          Facebook, Twitter, หรือ Google+ ของคุณ
          คุณมีหน้าที่รับผิดชอบในการจัดการบัญชีและรหัสผ่านของคุณเพื่อรักษารหัสผ่านของคุณเป็นความลับ
          คุณตกลงที่จะรับผิดชอบ แต่เพียงผู้เดียวในการ จำกัด
          การเข้าถึงบัญชีของคุณ
          คุณยอมรับว่าคุณต้องรับผิดชอบต่อกิจกรรมทั้งหมดที่เกิดขึ้นในบัญชีของคุณหรือผ่านการใช้รหัสผ่านของคุณเองหรือโดยบุคคลอื่นที่ใช้บัญชีของคุณ
          หากคุณเชื่อว่าบุคคลที่สามเข้าถึงรหัสผ่านของคุณคุณสามารถใช้คุณสมบัติการสร้างรหัสผ่านใหม่ของบริการโดยเร็วที่สุดเพื่อรับและสร้างรหัสผ่านใหม่
          คุณตกลงที่จะไม่อนุญาตให้บุคคลที่สามใด ๆ ใช้หรือเข้าถึงเว็บไซต์ในกรณีใด
          ๆ
          คุณยอมรับว่าผลิตภัณฑ์จริงที่คุณอาจได้รับอาจแตกต่างจากภาพที่แสดงเนื่องจากการวางจำหน่ายในตลาด
          ในการใช้บริการของเราคุณเห็นด้วยกับข้อความต่อไปนี้:
          คุณไม่สามารถปลอมแปลงหรือบิดเบือนความจริงของบุคคลหรือนิติบุคคลที่คุณเกี่ยวข้องด้วย
          ;
          คุณไม่เข้าสู่หน้าเว็บเพื่อแทรกแซงหรือทำให้เกิดความเสียหายและไม่ทำการแก้ไขที่ไม่ได้รับอนุญาต
          คุณตกลงที่จะไม่ใช้พื้นที่ใด ๆ ที่ไม่ใช่แบบสาธารณะของระบบบริการหรือ
          boxza.co.th ไม่ว่าในกรณีใด ๆ คุณไม่สามารถตรวจสอบ
          สแกนหรือทดสอบช่องโหว่ของบริการของหน้าเว็บหรือระบบหรือเครือข่ายใด ๆ
          ที่เกี่ยวข้องกับ boxza.co.th
          คุณไม่สามารถพยายามละเมิดมาตรการรักษาความปลอดภัยหรือการรับรองความถูกต้องใด
          ๆ ที่ใช้ในการเชื่อมต่อกับบริการและระบบและเครือข่ายดังกล่าว
          คุณตกลงที่จะไม่พยายามถอดรหัสหรือตรวจสอบซอฟต์แวร์หรือส่วนประกอบใด ๆ
          ที่ใช้เพื่อให้บริการแก่ boxza.co.th
          โดยการยอมรับข้อกำหนดการใช้งานของเราคุณตกลงที่จะไม่ทำร้ายหรือคุกคามต่อผู้ใช้รายอื่นในหน้าเว็บหรือพนักงานของ
          boxza.co.th
          คุณตกลงที่จะไม่แทรกแซงหรือพยายามที่จะแทรกแซงการเข้าถึงของผู้ใช้โฮสต์หรือเครือข่ายใด
          ๆ รวมถึง ไม่ จำกัด เพียงการส่งไวรัส การบรรทุกเกินพิกัด
          น้ำท่วมการส่งสแปมหรือการทิ้งระเบิด คุณไม่ได้รับอนุญาตให้
          ให้ข้อมูลการชำระเงินที่เป็นของบุคคลที่สาม
          คุณไม่สามารถใช้บริการในทางที่ไม่เหมาะสมซึ่งขัดต่อการใช้งานตามวัตถุประสงค์ของนโยบายและคำแนะนำของ
          boxza.co.th หรือกฎหมายที่เกี่ยวข้องใด ๆ
          คุณไม่ได้รับอนุญาตให้ดึงข้อมูลหรือเนื้อหาอื่น ๆ
          จากหน้าเว็บอย่างเป็นระบบเพื่อสร้างหรือรวบรวมทั้งทางตรงและทางอ้อมในการดาวน์โหลดครั้งเดียวหรือหลายครั้งการรวบรวมการรวบรวมฐานข้อมูลไดเรกทอรีหรือสิ่งอื่น
          ๆ ไม่ว่าจะด้วยวิธีการด้วยตนเอง
          ของบอทซอฟต์แวร์รวบรวมข้อมูลหรือสไปเดอร์หรืออย่างอื่น
          คุณไม่ต้องละเมิดสิทธิ์ในทรัพย์สินทางปัญญาของบุคคลที่สามเมื่อใช้หรือเข้าถึงบริการรวมถึง
          ไม่ จำกัด เพียงการทำรายการเสมือนจริงที่มีอยู่โดยการใช้บริการ
          คุณไม่สามารถส่งเสริมการเชื่อมโยงหรือให้การเข้าถึงเนื้อหาที่
          boxza.co.th พิจารณาตามที่เห็นสมควร
          แต่เพียงผู้เดียวว่าเป็นการล่วงละเมิดหรือก่อให้เกิดความเสียหายต่อชื่อเสียงของ
          boxza.co.th รวมถึง ไม่ จำกัด
          เฉพาะเนื้อหาที่ผิดกฎหมายและเนื้อหาลามกอนาจาร หรือเป็นอันตรายต่อ
          boxza.co.th และ / หรือบริการ (เช่นไซต์ Warez, บอท IRC
          และไซต์ที่ไม่เหมาะสม) โดยการใช้บริการ BOXZA
          คุณยอมรับข้อกำหนดและเงื่อนไขเหล่านี้รวมถึงวิธีการทำงานของ BOXZA
          ข้อกำหนดและเงื่อนไขเหล่านี้เป็นข้อตกลงทั้งหมดระหว่าง BOXZA และคุณ
          และแทนที่ข้อผูกพันก่อนหน้านี้
          การดำเนินการหรือการเป็นตัวแทนไม่ว่าจะเป็นลายลักษณ์อักษรหรือด้วยวาจาระหว่างคุณและ
          BOXZA ด้วยความเคารพต่อการใช้ BOXZA ของคุณ ข้อมูลเกี่ยวกับ BOXZA
          เช่นส่วน "F.A.Q", "Support", "Tutorial"
          เป็นเพียงคำแนะนำเท่านั้นและไม่ได้มีวัตถุประสงค์เพื่อเป็นกฎหรือแนวทาง
          BOXZA จะไม่รับผิดชอบ
          หรือรับผิดชอบต่อการกระทำของผู้ใช้หรือบุคคลอื่นที่ได้อ่านหรือรับทราบข้อมูลดังกล่าวหรือวัสดุที่เป็นลายลักษณ์อักษรอื่น
          ๆ ตามปกติ BOXZA
          ไม่สามารถรับประกันได้ว่าคุณจะเป็นผู้ชนะของแต่ละรายการโดยการซื้อกล่องลดราคา
          แต่ BOXZA สามารถรับประกันได้ว่าคุณจะได้รับรายการใด ๆ
          ที่คุณได้รับจากการ “ Open case” และก่อนการจัดส่ง
          โปรดตรวจสอบว่าเนื้อหาของทุกกรณีคืออะไรก่อนซื้อ
          หากคุณมีคำถามข้อสงสัยหรือความคิดเห็นเกี่ยวกับข้อกำหนดและเงื่อนไขของเราโปรดส่งอีเมลถึงเราที่
          support@boxza.co.th การสิ้นสุด
          เรามีสิทธิ์ที่จะยกเลิกหรือระงับการเข้าถึงบริการและ /
          หรือบัญชีของคุณทันทีโดยไม่ต้องแจ้งให้ทราบล่วงหน้าหรือมีความรับผิดด้วยเหตุผลใดก็ตามรวมถึง
          ไม่ จำกัด เพียงถ้าคุณละเมิดข้อกำหนด
          บทบัญญัติทั้งหมดของข้อกำหนดซึ่งโดยธรรมชาติของพวกเขาควรอยู่รอดการสิ้นสุด
          ซึ่งรวมถึง ไม่ จำกัด
          เพียงข้อกำหนดการเป็นเจ้าของการสละสิทธิ์การรับประกันการชดใช้ค่าเสียหายและข้อจำกัดความรับผิด
          สิทธิ์ในการใช้บริการจะสิ้นสุดลงทันที
          หากคุณต้องการยกเลิกบัญชีของคุณคุณสามารถหยุดใช้บริการได้
          การลิงค์ไปยังเว็บไซต์อื่น ๆ
          บริการของเราอาจมีลิงค์ไปยังเว็บไซต์หรือบริการของบุคคลที่สามที่ไม่ได้เป็นเจ้าของหรือควบคุมโดย
          boxza.co.th / BOXZA
          ไม่มีอำนาจควบคุมและไม่รับผิดชอบต่อเนื้อหานโยบายความเป็นส่วนตัวหรือแนวทางปฏิบัติของเว็บไซต์หรือบริการของบุคคลที่สาม
          คุณรับทราบและยอมรับเพิ่มเติมว่า BOXZA จะไม่รับผิดชอบ
          หรือรับผิดทั้งทางตรงและทางอ้อมสำหรับความเสียหายหรือการสูญเสียใด ๆ
          ที่เกิดหรือถูกกล่าวหาว่ามีสาเหตุมาจากหรือเกี่ยวข้องกับการใช้หรือการพึ่งพาเนื้อหาสินค้าหรือบริการใด
          ๆ เว็บไซต์หรือบริการใด ๆ ดังกล่าว
          เราขอแนะนำให้คุณอ่านข้อกำหนดและเงื่อนไขและนโยบายความเป็นส่วนตัวของเว็บไซต์หรือบริการของบุคคลที่สามที่คุณเข้าชม
          ข้อจำกัดความรับผิดชอบของการรับประกัน เว็บไซต์นี้จัดทำ“ ตามสภาพ”
          โดยไม่มีการรับรองหรือรับประกันไม่ว่าโดยชัดแจ้งหรือโดยนัย
          www.boxza.co.th ไม่รับรองหรือรับประกันใด ๆ
          เกี่ยวกับเว็บไซต์นี้หรือข้อมูลและวัสดุที่มีให้ในเว็บไซต์นี้
          www.boxza.co.th ไม่รับประกันว่า: เว็บไซต์นี้จะเปิดให้บริการตลอดเวลา
          หรือข้อมูลในเว็บไซต์นี้สมบูรณ์ถูกต้องแม่นยำหรือไม่ทำให้เข้าใจผิด
          ไม่มีสิ่งใดในเว็บไซต์นี้ที่ก่อให้เกิดขึ้น
          หรือมีไว้เพื่อประกอบคำแนะนำใด ๆ
          หากคุณต้องการคำแนะนำเกี่ยวกับเรื่องทางกฎหมายการเงินหรือการแพทย์คุณควรปรึกษาผู้เชี่ยวชาญที่เหมาะสม
          BOXZA Wallet เมื่อเติมเงินเข้าไปในกระเป๋าเงิน BOXZA ของคุณ
          คุณยอมรับว่าเครดิตที่ได้รับ
          ไม่สามารถเเทนเป็นเงินจริงและไม่ต้องการขอคืนเงินใด ๆ
          การเปลี่ยนแปลงข้อกำหนดและเงื่อนไข BOXZA อาจเปลี่ยนแปลง
          (เพิ่มลบหรือแก้ไข)
          ข้อกำหนดและเงื่อนไขเป็นครั้งคราวโดยมีหรือไม่มีสาเหตุ
          หากสิ่งนี้เกิดขึ้นคุณยอมรับว่า BOXZA
          อาจแจ้งให้คุณทราบถึงการเปลี่ยนแปลงดังกล่าวด้วยวิธีใดวิธีหนึ่งต่อไปนี้:
          ผ่านอีเมลจาก BOXZA ผ่านการประกาศโซเชียลมีเดียบล็อกของ BOXZA และ /
          หรือโดยการโพสต์ประกาศเปลี่ยนแปลงบนเว็บไซต์สำหรับ เวลาที่ จำกัด
          สมเหตุสมผล
          เป็นความรับผิดชอบของคุณในการตรวจสอบข้อกำหนดและเงื่อนไขที่แก้ไขใด ๆ
          หากคุณพบว่าการแก้ไขใด ๆ
          ที่ตามมาไม่สามารถยอมรับได้คุณจะต้องหยุดใช้บริการ BOXZA
          โดยการเข้าถึงเข้าถึงใช้หรือดาวน์โหลดในลักษณะใดก็ตามบริการใด ๆ จาก
          BOXZA
          หลังจากแจ้งให้ทราบถึงการแก้ไขข้อกำหนดและเงื่อนไขคุณยอมรับและผูกพันตามข้อกำหนดและเงื่อนไขตามที่มีการแก้ไข
          การซื้อกล่อง ตามกรณีที่เปิด (กล่อง)
          คุณตกลงที่จะรับหนึ่งในรายการแบบสุ่มภายใน BOXZA
          ใช้อัลกอริทึมที่ยุติธรรมอย่างพิสูจน์ได้
          ประสบการณ์ก่อนหน้านี้จะไม่ส่งผลต่อโอกาสในกรณีถัดไปที่จะได้รับรายการพิเศษ
          BOXZA ขอสงวนสิทธิ์ในการเปลี่ยนแปลงราคาในบางกรณี BOXZA อาจใช้ดุลยพินิจ
          แต่เพียงผู้เดียวในการเสนอผลิตภัณฑ์ที่เลือกสำหรับการซื้อโดยตรงผ่านร้าน
          BOXZA BOXZA ขอสงวนสิทธิ์ตามดุลยพินิจ แต่เพียงผู้เดียวในการ จำกัด
          จำนวนผลิตภัณฑ์ต่อผู้ใช้ที่อาจซื้อผ่านร้านค้า BOXZA
          ผลิตภัณฑ์ที่นำเสนอผ่านร้าน BOXZA
          เป็นบัตรของขวัญและคูปองส่วนลดสำหรับสินค้าเว้นแต่จะระบุไว้เป็นพิเศษ
          BOXZA ไม่ได้เป็นเจ้าของหรือเก็บรายการเหล่านี้
          พวกเขาจะส่งมอบผ่านบุคคลที่สามซึ่งจะนำบัตรของขวัญของเราไปใช้ในนามของผู้ใช้
          BOXZA
          ขอสงวนสิทธิ์ในการเปลี่ยนแปลงราคาของบัตรของขวัญในร้านเป็นครั้งคราวตามดุลยพินิจของตน
          การส่งคืน / ยกเลิก BOXZA
          อนุญาตให้ลูกค้ายกเลิกเงินตามนโยบายการคืนเงินของ BOXZA ซึ่ง BOXZA
          อาจเปลี่ยนแปลงได้ตามดุลยพินิจของตน แต่เพียงผู้เดียว
          หากคุณยกเลิกคำสั่งซื้อ ก่อนที่จะดำเนินการคุณจะได้รับเงินคืนเต็มจำนวน
          หากสินค้าถูกจัดส่งไปแล้วจะไม่สามารถยกเลิกคำสั่งซื้อได้
          หากคุณต้องการยกเลิกคำสั่งซื้อโปรดติดต่อเราตามข้อมูลที่ให้ทางหน้าเวปไซต์
          หรือใช้ฟังก์ชั่นนี้ในโปรไฟล์ส่วนตัวของคุณ หาก BOXZA
          ไม่สามารถส่งมอบผลิตภัณฑ์ที่สั่งซื้อหรือผลิตภัณฑ์ที่ได้รับรางวัลไม่ว่าจะด้วยเหตุผลใดก็ตามคุณจะมีตัวเลือกในการรับสินค้าทางเลือกอื่น
          ๆ ที่เทียบเคียงกันได้ซึ่ง BOXZA กำหนดขึ้นอยู่กับดุลยพินิจของตน
          อัตราต่อรองของการชนะแต่ละรายการผ่านทางกล่อง
          ทุกกรณีนั้นจะไม่เหมือนกันและผลลัพธ์ของทุกกรณีที่นำเสนอบน BOXZA
          ขึ้นอยู่กับอัลกอริทึมที่ยุติธรรมซึ่งพิสูจน์ได้
          การเข้าร่วมในการซื้อสินค้าดังกล่าวจะไม่ส่งผลกระทบต่อทักษะหรือประสบการณ์กรณีก่อน
          เราพยายามกำหนดข้อตกลงและเงื่อนไขนโยบายและกฎระเบียบของเราอย่างเรียบง่ายและโปร่งใส
          หากคุณมีคำถามหรือปัญหาที่เกี่ยวข้องกับข้อกำหนดเงื่อนไขนโยบายหรือกฎระเบียบของเราหรือวิธีการนำเสนอโปรดอย่าลังเลที่จะติดต่อเราที่:
          support@boxza.co.th
          หรือคุณสามารถติดต่อเราโดยตรงผ่านเว็บไซต์ของเราผ่านการสนับสนุนของเรา
          ส่วนบน https://boxza.co.th
          โปรดตรวจสอบให้แน่ใจว่าคุณเข้าใจกระบวนการและข้อกำหนดของเกมทั้งหมด
          วัตถุประสงค์ของข้อกำหนดและเงื่อนไขเหล่านี้คือ: ·เพื่อกำหนดพื้นฐานที่
          BOXZA จะอนุญาตให้ผู้ใช้เข้าถึงเว็บไซต์และบริการ;
          ·เพื่อแจ้งให้ผู้ใช้ทราบเกี่ยวกับความคุ้มครองที่เราจัดให้เพื่อให้แน่ใจว่ากรณีของเรามีความยุติธรรมและโปร่งใส
          ·เพื่อสร้างพารามิเตอร์ที่ควบคุมรายการกล่องและการชำระของ
          เราอาจแก้ไขข้อตกลงและเงื่อนไขของเราเป็นครั้งคราวดังนั้นคุณควรตรวจสอบให้แน่ใจว่าคุณได้อ่านและทำความเข้าใจข้อกำหนดและเงื่อนไขซึ่งมีผลบังคับใช้ในเวลาที่เกี่ยวข้อง
          ทุกครั้งที่คุณใช้เว็บไซต์ข้อกำหนดและเงื่อนไขที่บังคับใช้ในเวลานั้นจะมีผลบังคับใช้กับสัญญาระหว่างคุณกับเรา
          คุณควรพิมพ์สำเนาข้อกำหนดในการให้บริการเหล่านี้หรือบันทึกไว้ในคอมพิวเตอร์ของคุณเพื่อใช้อ้างอิงในอนาคต
          ในกรณีที่ข้อกำหนดในการให้บริการของเราได้รับการอัปเดตผู้ที่เผยแพร่ในเวลาเริ่มต้นของกรณีที่เปิดจะมีผลบังคับใช้กับกรณีดังกล่าว
          การลงทะเบียนบัญชีผู้ใช้ เมื่อคุณลงทะเบียนบัญชีของคุณกับ BOXZA
          ในครั้งแรกคุณจะต้องให้ข้อมูลส่วนบุคคลบางอย่างรวมถึง:
          ชื่อผู้ใช้·วันเดือนปีเกิด · ที่อยู่อีเมล;
          กฎหมายกำหนดให้เราต้องรวบรวมและตรวจสอบข้อมูลนี้และเราจะพยายามอย่างเต็มที่เพื่อรักษาข้อมูลส่วนตัวให้ปลอดภัย
          สำหรับข้อมูลเพิ่มเติมโปรดดูนโยบายความเป็นส่วนตัวของเรา
          ผู้ใช้แต่ละคนสามารถสร้างบัญชีผู้ใช้เดียวเท่านั้นที่ไม่สามารถถ่ายโอนได้และคุณควรตรวจสอบให้แน่ใจว่าการเข้าถึงบัญชีของคุณได้รับการคุ้มครองโดยการรักษารหัสผ่านเป็นความลับตลอดเวลา
          ข้อมูลส่วนบุคคลที่คุณให้กับเราในการลงทะเบียนจะได้รับการตรวจสอบเพื่อให้แน่ใจว่าคุณยังไม่มีบัญชีผู้ใช้ที่มีอยู่กับเรา
          บัญชีผู้ใช้สามารถใช้งานได้เฉพาะบุคคลที่สร้างขึ้นและไม่ใช่ผู้อื่น
          เราขอสงวนสิทธิ์ในการปิดบัญชีผู้ใช้ของคุณหากเรามีเหตุผลที่จะเชื่อว่ามันหรือรายละเอียดบัญชีผู้ใช้ของคุณ
          / บุคคลอื่นที่ไม่ใช่คุณและ / หรือคุณไม่ได้ใช้รหัสผ่านของคุณเป็นความลับ
          คุณจะชดใช้ค่าเสียหายความเสียหายค่าใช้จ่ายและค่าใช้จ่ายทั้งหมดที่เราอาจได้รับจากการที่คุณไม่สามารถรักษาชื่อผู้ใช้และรหัสผ่านของคุณเป็นความลับอย่างเคร่งครัด
          เพื่อความปลอดภัยเราแนะนำทันทีหลังจากลงทะเบียนเปิดใช้งานการอนุญาต
          2Factor เมื่อคุณลงทะเบียนบัญชีผู้ใช้เรียบร้อยแล้ว BOXZA
          มอบสิทธิ์การใช้งานที่เพิกถอนได้และไม่ผูกขาดให้คุณในการเข้าถึงและใช้เว็บไซต์และบริการภายใต้เงื่อนไขดังต่อไปนี้:
          ·คุณตกลงที่จะปฏิบัติตามข้อกำหนดและเงื่อนไขและให้การรับประกันผู้ใช้
          ออกด้านล่าง;
          ·คุณรับทราบว่าไม่ว่าในกรณีใดเราหรือซัพพลายเออร์ของเราจะไม่รับผิดชอบใด
          ๆ ที่เกิดขึ้นจากความสูญเสียที่อาจเกิดขึ้นจากการเข้าใช้เว็บไซต์และ /
          หรือการใช้บริการ ·คุณรับทราบว่า BOXZA
          จะเก็บข้อมูลส่วนบุคคลบางอย่างเกี่ยวกับตัวตนของคุณรวมถึง ไม่ จำกัด
          เฉพาะชื่อที่อยู่วันเกิดและรายละเอียดการชำระเงิน
          คุณยอมรับว่าเราพึ่งพาข้อมูลนี้ในการทำข้อตกลงกับเราและคุณตกลงที่จะไม่ทำอันตรายต่อความเท็จหรือความไม่ถูกต้องในข้อมูลที่คุณให้เรา
          ·คุณจะไม่อัปโหลดเนื้อหาไปยังเว็บไซต์หากคุณไม่ได้เป็นเจ้าของลิขสิทธิ์หรือได้รับอนุญาตอย่างชัดแจ้งจากเจ้าของลิขสิทธิ์ให้ทำเช่นนั้น
          ·คุณจะไม่ปิดบังหรือแทรกแซงไม่ว่าทางใดทางหนึ่งด้วยที่อยู่ IP
          ของอุปกรณ์ที่คุณใช้เพื่อเข้าถึงเว็บไซต์หรือทำตามขั้นตอนต่าง ๆ
          เพื่อป้องกันไม่ให้เราระบุที่อยู่ IP
          ที่แท้จริงของอุปกรณ์ที่คุณใช้ในขณะที่เข้าถึงเว็บไซต์ ;
          ·การใช้งานเว็บไซต์ของคุณและการให้บริการของเราแก่คุณไม่มีสิทธิ์ใด ๆ
          ที่เกี่ยวข้องกับเนื้อหาและสิทธิ์ในทรัพย์สินทางปัญญาที่เกี่ยวข้องที่เผยแพร่บนเว็บไซต์
          การรับประกันของผู้ใช้
          เมื่อคุณลงทะเบียนบัญชีผู้ใช้ครั้งแรกคุณจะต้องตรวจสอบและยืนยันรายละเอียดส่วนบุคคลของคุณเพื่อยืนยันการยอมรับข้อกำหนดและเงื่อนไขเหล่านี้
          เพื่อเป็นการตอบแทนสำหรับเราที่ยอมรับการสมัครของคุณเพื่อลงทะเบียนบัญชีผู้ใช้คุณรับรองและรับประกันต่อ
          boxza.co.th ดังนี้: ·คุณอายุ 18
          ปีขึ้นไปมีจิตใจที่ดีและสามารถรับผิดชอบต่อการกระทำของคุณเองและ
          คุณสามารถทำข้อตกลงที่มีผลผูกพันตามกฎหมายกับเรา
          ·ข้อมูลส่วนบุคคลที่ส่งในแอปพลิเคชันของคุณเพื่อลงทะเบียนบัญชีผู้ใช้เป็นความจริงถูกต้องแม่นยำและไม่ทำให้เข้าใจผิดและคุณจะได้รับข้อมูลล่าสุดอยู่เสมอ
          ·คุณไม่ได้ถูกตัดสินว่ากระทำความผิดทางการเงินเช่นการฟอกเงินหรือการฉ้อโกง
          ·คุณยังไม่ได้รับการประกาศล้มละลายไม่ได้เข้าทำข้อตกลงอย่างเป็นทางการกับเจ้าหนี้และไม่อยู่ภายใต้การตัดสินของศาลมณฑล
          คุณจะต้องถือครองบัญชีผู้ใช้ตลอดเวลาตามกฎหมายที่เกี่ยวข้องทั้งหมดในเขตอำนาจศาลที่คุณอาศัยอยู่ว่าคุณจะไม่ได้ตลอดเวลาในขณะที่ถือบัญชีผู้ใช้พยายามที่จะจัดการหรือในทางใด
          ๆ ที่ส่งผลกระทบต่อผลของการเล่นใด ๆ
          หากเราเชื่อว่าคุณได้ละเมิดการรับประกันผู้ใช้เหล่านี้หนึ่งรายขึ้นไปบัญชีผู้ใช้ของคุณอาจถูกตรวจสอบและอาจส่งผลให้เกิดดึงของที่คุณเล่นได้คืนและ
          / หรือบัญชีผู้ใช้ของคุณถูกระงับและ / หรือปิด
          การตรวจสอบอายุและเอกลักษณ์
          มันเป็นความผิดสำหรับบุคคลใดก็ตามที่อายุต่ำกว่า 18 ปีในการเล่น
          boxza.co.th
          ทางเราสามารถที่จะใช้ผู้ให้บริการบุคคลที่สามเพื่อตรวจสอบข้อมูลส่วนบุคคลที่คุณให้เมื่อคุณลงทะเบียนบัญชีผู้ใช้เพื่อให้แน่ใจว่าคุณอายุ
          18 ปีขึ้นไป
          สิ่งนี้อาจเกี่ยวข้องกับการจัดหารายละเอียดที่คุณให้กับหน่วยงานข้อมูลที่ได้รับอนุญาต
          โดยเฉพาะอย่างยิ่งเราอาจตรวจสอบว่าคุณอายุ 18
          ปีขึ้นไปว่าคุณพำนักอยู่ในประเทศที่คุณบอกว่าคุณเป็นผู้อยู่อาศัยและ /
          หรือตัวตนของคุณตรงกับตัวตนของแหล่งที่มาของเงินฝากในบัญชีผู้ใช้ของคุณ
          หากไม่เป็นเช่นนั้นเราจะขอข้อมูลเพิ่มเติมจากคุณเพื่อให้คุณสามารถเข้าถึงเว็บไซต์และจะขอข้อมูลทางอีเมลหรือโดยตรงผ่านเว็บไซต์
          โดยการยอมรับข้อกำหนดและเงื่อนไขเหล่านี้คุณอนุญาตให้เราดำเนินการตรวจสอบข้อมูลเหล่านี้ผ่านทางผู้ให้บริการบุคคลที่สามของเรา
          คุณจะไม่สามารถถอนของที่เล่นได้จากบัญชีผู้ใช้ของคุณได้จนกว่าอายุและการยืนยันตัวตนจะเสร็จสมบูรณ์
          ผู้ใช้ที่ให้ข้อมูลที่ไม่ถูกต้องหรือเป็นเท็จเกี่ยวกับอายุหรือข้อมูลประจำตัวของพวกเขา
          อาจถูกริบรางวัลใด ๆ ที่ชนะและจะปิดบัญชีผู้ใช้
          เราขอสงวนสิทธิ์ในการแจ้งต่อหน่วยงานที่เกี่ยวข้องซึ่งอาจส่งผลให้มีการดำเนินคดีทางแพ่งหรือคดีอาญา
          ความรับผิดชอบและการปฏิบัติของผู้ใช้
          นับจากเวลาที่คุณลงทะเบียนบัญชีผู้ใช้ของคุณจนกว่าจะถูกปิด
          (ไม่ว่าจะด้วยเหตุผลใดก็ตาม)
          คุณตกลงที่จะปฏิบัติตามข้อกำหนดและเงื่อนไขทั้งหมดที่กำหนดไว้ในที่นี้และกระทำการโดยสุจริตในการติดต่อกับ
          boxza.co.th
          คุณเข้าใจดีว่าคุณอาจสูญเสียเงินในการเล่นบนเว็บไซต์และยอมรับว่าคุณรับผิดชอบอย่างเพียงผู้เดียวสำหรับการสูญเสีย
          คุณยอมรับว่าไม่ว่าในกรณีใด ๆ
          จำนวนเงินที่คุณสูญเสียจะเป็นผลมาจากการเล่นของคุณเอง
          และเราจะไม่รับผิดชอบใด ๆ ที่เกี่ยวข้องกับการสูญเสียดังกล่าว
          คุณยอมรับว่าคุณจะไม่ใช้เว็บไซต์และ /
          หรือบริการในทางที่อาจนำไปสู่การให้กำลังใจจัดซื้อหรือดำเนินกิจกรรมใด ๆ
          ที่ผิดกฎหมายหรือผิดกฎหมายหรือก่อให้เกิดความเดือดร้อนอันตรายหรือความไม่สะดวกแก่บุคคลอื่น
          คุณจะไม่เลือกชื่อผู้ใช้ที่น่ารังเกียจแสดงความคิดเห็นเชิงรุกใช้เนื้อหาที่น่ารังเกียจหรือลามกอนาจารหรืออาจทำให้เสื่อมเสียชื่อเสียงหรือมีการพูดถึงการสนทนาที่เกี่ยวข้องกับการแชทหรือหน้าที่ทางสังคมอื่น
          ๆ หรือส่วนอื่น ๆ ของเว็บไซต์รวมถึงข้อมูลบัญชีผู้ใช้
          เราจะไม่รับผิดต่อคุณสำหรับความสูญเสียใด ๆ
          ที่คุณอาจเกิดขึ้นจากการใช้รหัสผ่านของคุณในทางที่ผิดและเราจะไม่รับผิดชอบใด
          ๆ ที่เกิดขึ้นจากการใช้งานที่ไม่ได้รับอนุญาตไม่ว่าจะเป็นการฉ้อโกง
          ข้อมูลที่คุณเข้าถึงบนเว็บไซต์ของเรารวมถึง ไม่ จำกัด
          เฉพาะผลลัพธ์สถิติข้อมูลเกมและการแข่งขันนั้นมีไว้เพื่อการใช้งานส่วนตัวของคุณเท่านั้นและห้ามมิให้มีการเผยแพร่หรือแสวงหาประโยชน์ทางการค้าจากข้อมูลดังกล่าวในเชิงพาณิชย์
          การฝ่าฝืนข้อกำหนดและเงื่อนไขเหล่านี้
          คุณตกลงที่จะชดใช้ค่าเสียหายและทำให้เราและ บริษัท
          ในเครือเจ้าหน้าที่ผู้อำนวยการตัวแทนและพนักงานของเราที่ไม่เป็นอันตรายจากหนี้สินการเรียกร้องการสูญเสียหรือความต้องการใด
          ๆ ที่เกิดขึ้นจากการฝ่าฝืนข้อกำหนดและเงื่อนไขเหล่านี้หรือการฝ่าฝืน
          คุณของกฎหมายหรือสิทธิของบุคคลที่สามใด ๆ ในกรณีที่มีการละเมิด
          บัญชีผู้ใช้ของคุณอาจถูกระงับการตรวจสอบและรางวัลที่คุณได้รับอาจถูกระงับและ
          boxza
          อาจรักษายอดคงเหลือในเชิงบวกไว้ในบัญชีผู้ใช้ของคุณเพื่อรอการสรุปการสอบสวนและ
          / หรือกระบวนการทางกฎหมายที่เกี่ยวข้อง การสืบสวน
          หากเราระงับบัญชีผู้ใช้ของคุณและ /
          หรือทำให้การเดิมพันของคุณเป็นโมฆะเราจะตรวจสอบสถานการณ์ที่นำไปสู่การดำเนินการนี้โดยเร็วที่สุดเท่าที่จะทำได้และจะแจ้งให้คุณทราบโดยทันทีเกี่ยวกับข้อสรุปและวิธีการรักษา
          ในการตรวจสอบดังกล่าวเราจะใช้กฎข้อมูลที่เราได้รับจากอัลกอริธึมการเก็บข้อมูลข้อมูลจากการเล่นเกมที่มีอยู่และฐานข้อมูลบันทึกธุรกรรม
          (และข้อมูลอื่น ๆ ที่เกี่ยวข้อง)
          เป็นหลักฐานเพื่อสนับสนุนข้อสรุปและการกระทำของเรา
          หากคุณไม่พึงพอใจกับข้อสรุปของการสืบสวนหรือการกระทำใด ๆ
          ที่เราทำดังนั้นโปรดใช้ขั้นตอนการร้องเรียนและข้อพิพาทที่ระบุไว้ในเอกสารนี้
          หากคุณมีเงินฝากในบัญชีที่ถูกระงับหรือปิดโปรดติดต่อเราทันทีตามข้อมูลจากหน้าเวปไซต์
          อย่างไรก็ตามเราขอสงวนสิทธิ์ในการระงับเงินในบัญชีผู้ใช้ของคุณเพื่อรอการสรุปการสอบสวนที่เกี่ยวข้อง
          (รวมถึงการตรวจสอบภายนอกที่เกี่ยวข้อง)
          นอกจากนี้เรายังสงวนสิทธิ์ในการให้รายละเอียดของผู้ใช้และผลลัพธ์ของการตรวจสอบดังกล่าวไปยังหน่วยงานที่เกี่ยวข้องเพื่อช่วยเหลือในการตรวจสอบ
          บัญชีที่ถูกระงับหรือถูกปิด เราอาจ จำกัด การเข้าถึง BOXZA
          ระงับหรือปิดบัญชีผู้ใช้ของคุณและ / หรือโมฆะการเดิมพัน / รายการใด ๆ
          ที่คุณอาจมียอดค้างชำระตามดุลยพินิจของเราหาก:
          ·เราสงสัยว่าคุณอายุต่ำกว่า 18 ปี (หรืออายุต่ำกว่า 18 ปี)
          บัญชีผู้ใช้ที่ใช้งานกับเรา); ·เราสงสัยว่าข้อมูลส่วนบุคคลใด ๆ
          ของคุณไม่ถูกต้อง ·เราไม่สามารถยืนยันข้อมูลส่วนบุคคลของคุณ
          ·เรามีเหตุผลที่เชื่อได้ว่าคุณได้ลงทะเบียนและ /
          หรือกำลังใช้งานมากกว่าหนึ่งบัญชีหรือกำลังสมรู้ร่วมคิดกับคนอื่น ๆ ;
          ·เราสงสัยว่าคุณกำลังโกง
          ·เราสงสัยว่าคุณมีส่วนร่วมในกิจกรรมที่ผิดกฎหมายและ / หรือการฉ้อโกง
          ·เราสงสัยว่าคุณมี (หรืออาจ) ละเมิดข้อกำหนดและเงื่อนไขเหล่านี้
          ·เราสงสัยว่าคุณอาจประสบปัญหาในการได้รับเครดิตหรือคุณเป็นนักเล่นที่มีปัญหา
          ·กระทำการใด ๆ
          ที่เป็นการฝ่าฝืนกฎหมายระเบียบข้อบังคับหรือจรรยาบรรณหรือทำสิ่งใด
          ๆ·เราสงสัยว่าคุณกำลังทำตัวในลักษณะที่เป็นอันตรายต่อการดำเนินธุรกิจของเราหรืออาจส่งผลให้เกิดความรับผิดตามกฎหมายสำหรับคุณเราหรือบุคคลที่สาม
          ภายใต้การสอบสวนเรามีสิทธิ์ที่จะปิดบัญชีผู้ใช้ของคุณและยกเลิกข้อกำหนดและเงื่อนไขเหล่านี้โดยแจ้งให้คุณทราบถึงที่อยู่อีเมลที่ลงทะเบียนของคุณและตามประกาศดังกล่าวคุณจะไม่สามารถเข้าถึงเว็บไซต์หรือบริการอื่น
          ๆ ยอดคงค้างใด ๆ ในบัญชีผู้ใช้ของคุณ
          การยกเลิกดังกล่าวจะมีผลนับจากวันที่แจ้งให้เราปิดบัญชีผู้ใช้ของคุณซึ่งเราส่ง
          แต่จะไม่ส่งผลต่อการเดิมพันที่คงค้างใด ๆ
          หากพวกเขาถูกต้องและไม่ละเมิดข้อกำหนดและเงื่อนไขเหล่านี้
          การเดิมพันที่ละเมิดข้อกำหนดและเงื่อนไขเหล่านี้จะถือเป็นโมฆะ
          ในกรณีที่สงสัยว่ามีการฉ้อโกงหรือการฟอกเงินผู้ใช้อาจไม่มีสิทธิ์ถอนเงินออกจากบัญชีผู้ใช้
          เงินที่เหลืออยู่ในบัญชีที่ถูกปิดโดย BOXZA
          อันเป็นผลมาจากปัญหาความสมบูรณ์จะนำไปบริจาคเพื่อการกุศลที่เราเลือก
          การตัดสินใจปิดบัญชีจะขึ้นอยู่กับดุลยพินิจของ BOXZA
          หลังจากการสอบสวนที่เกี่ยวข้องเกิดขึ้น
          ในช่วงระยะเวลาการตรวจสอบนี้เงินทั้งหมดที่เป็นของผู้ใช้จะถูกหยุดไว้
          หากคุณตระหนักถึงการโกงผู้เล่นหรือการสมรู้ร่วมคิดระหว่างผู้เล่นใน BOXZA
          โปรดติดต่อ support@boxza.co.th เรื่องที่อยู่นอกเหนือการควบคุมของเรา
          หากปราศจากอคติต่อภาระผูกพันของเราภายใต้กฎหมายและข้อบังคับของเขตอำนาจศาลที่เราได้รับใบอนุญาตเราจะไม่รับผิดชอบต่อความสูญเสียหรือความเสียหายที่ผู้ใช้อาจได้รับจากการควบคุมของเราซึ่งรวมถึง
          (ไม่ จำกัด เพียง): การกระทำของพระเจ้า; · ตัดไฟ;
          ·สงครามหรือการก่อการร้าย·การจลาจลและ /
          หรือความวุ่นวายทางแพ่ง·การบุกรุกการโจมตีของผู้ก่อการร้ายหรือการคุกคามของการโจมตีของผู้ก่อการร้ายสงคราม
          (ไม่ว่าจะประกาศหรือไม่ก็ตาม)
          หรือการคุกคามหรือเตรียมความพร้อมสำหรับสงคราม
          การระเบิด·น้ำท่วมหรือพายุ·แผ่นดินไหวการทรุดตัวการแพร่ระบาดหรือภัยธรรมชาติอื่น
          ๆ
          ·อุบัติเหตุนิวเคลียร์·การกระทำความล้มเหลวหรือการละเลยของรัฐบาลหรือหน่วยงานใด
          ๆ - สิ่งกีดขวางหรือล้มเหลวของบริการโทรคมนาคมของรัฐหรือเอกชนและ /
          หรืออินเทอร์เน็ต - ความล่าช้าหรือความล้มเหลวอื่น ๆ
          ที่เกิดจากบุคคลที่สามหรืออื่น ๆ ที่อยู่นอกเหนือการควบคุมของเรา
          หากมีเหตุการณ์ที่อยู่นอกเหนือการควบคุมของเราเกิดขึ้นเราขอสงวนสิทธิ์ในการระงับหรือยกเลิกบริการโดยไม่ต้องรับผิดชอบใด
          ๆ
          ในกรณีที่มีการยกเลิกหรือระงับบริการเราจะพยายามแจ้งให้คุณทราบโดยเร็วที่สุดเท่าที่จะทำได้
          BOXZA จะไม่รับผิดชอบต่อความล้มเหลวของอุปกรณ์หรือซอฟต์แวร์ใด ๆ
          ที่เกิดขึ้นไม่ว่าจะอยู่ที่ใดหรืออยู่ภายใต้การควบคุมของเราไม่ว่าจะอยู่ภายใต้การควบคุมโดยตรงของเราหรือไม่ก็ตามซึ่งอาจป้องกันการให้บริการ
          ลืมบัญชีผู้ใช้ชื่อผู้ใช้ / รหัสผ่าน
          หากคุณลืมชื่อผู้ใช้หรือรหัสผ่านโปรดทำตามคำแนะนำการกู้คืนรหัสผ่านบนเว็บไซต์
          หากคุณไม่สามารถลงชื่อเข้าใช้บัญชีของคุณโปรดติดต่อเราเพื่อขอความช่วยเหลือได้ตลอดเวลา
          support@boxza.co.th การดำเนินงานของเว็บไซต์และบริการ เว็บไซต์และบริการ
          BOXZA อนุญาตให้ผู้ใช้งานเข้าถึงเกมตามที่เรามีให้และบริหารจัดการ
          การเข้าถึงเว็บไซต์อยู่ภายใต้ข้อกำหนดและเงื่อนไขเหล่านี้และในบางกรณีจะถูกควบคุมโดยกฎ
          โปรดอ่านทั้งสองอย่างละเอียดก่อนเข้าเกมใด ๆ และติดต่อเราหากคุณมีคำถามใด
          ๆ : support@boxza.co.th BOXZA ไม่รับรองอินเทอร์เฟซของบุคคลที่สามใด ๆ
          ที่ให้การเข้าถึงบริการของ BOXZA
          ผู้ใช้ที่ใช้ซอฟต์แวร์บุคคลที่สามซึ่งเข้าถึงสิ่งอำนวยความสะดวกของเราควรทราบว่านี่อาจไม่แสดงข้อมูลทั้งหมดเกี่ยวกับการเดิมพันของคุณ
          ข้อผิดพลาด
          แม้ว่าเราจะพยายามอย่างเต็มที่เพื่อให้มั่นใจว่าผลลัพธ์การคำนวณและการจ่ายเงินชนะอย่างสมบูรณ์เราจะไม่รับผิดชอบต่อข้อผิดพลาดในข้อมูลบนเว็บไซต์ซึ่งเราไม่ได้ควบคุมโดยตรงรวมถึง
          ไม่ จำกัด เฉพาะผลลัพธ์หรือเหตุการณ์เวลาเริ่มต้นของ
          เหตุการณ์ที่เกิดขึ้น
          หากผลลัพธ์ที่ใช้ในการตัดสินเหตุการณ์มีการเปลี่ยนแปลงหลังจากการตัดสินของตลาดไม่ว่าด้วยเหตุผลใด
          ๆ (นอกเหนือจากข้อผิดพลาดของเรา)
          เช่นการตัดสิทธิ์หรือสงสัยว่ามีอาชญากรรมหรือการฉ้อโกงผลของคดีจะยังคงอยู่
          หากการจ่ายเงินสำหรับรางวัลแก่ผู้ใช้ที่มีข้อผิดพลาดเราขอสงวนสิทธิ์ในการปรับที่เหมาะสมกับยอดเงินในบัญชีของผู้ใช้นั้นเพื่อแก้ไขข้อผิดพลาดดังกล่าว
          หากผู้ใช้มีเงินไม่เพียงพอที่จะทำการปรับเปลี่ยนนี้ผู้ใช้ตกลงที่จะให้เงินทุนที่จำเป็นในการแก้ไขข้อผิดพลาดโดยเร็วที่สุด
          ธุรกรรมทางการเงินเงินฝาก
          เราสนับสนุนวิธีการฝากเงินเข้าบัญชีผู้ใช้ด้วยเงินฝากขั้นต่ำ 50 บาท:
          บัตรเครดิต · บัตรเดบิต;
          ขณะนี้ไม่มีการเรียกเก็บเงินที่เกี่ยวข้องกับวิธีการชำระเงินใด ๆ
          ซึ่งอาจมีการเปลี่ยนแปลงในภายหลัง
          เราจะไม่รับผิดชอบค่าใช้จ่ายเพิ่มเติมที่อาจเกิดขึ้นจากบัตรเครดิตหรือธนาคารของคุณเมื่อคุณทำการฝากเงินดังนั้นโปรดแจ้งข้อกังวลใด
          ๆ กับสถาบันที่เกี่ยวข้องโดยตรง
          หากผู้ใช้ต้องการฝากเงินโดยใช้บัตรเครดิตหรือบัตรเดบิตชื่อและที่อยู่ของผู้ถือบัตรจะต้องเหมือนกับชื่อและที่อยู่ที่ลงทะเบียนด้วยบัญชีผู้ใช้
          ผู้ใช้ควรกำหนดวงเงินฝากของเงินฝาก
          หากคุณต้องการเปลี่ยนวงเงินฝากคุณสามารถทำได้ผ่านหน้าการตั้งค่าหรือติดต่อเรา:
          support@boxza.co.th การเปลี่ยนแปลงใด ๆ ในข้อ จำกัด
          เหล่านี้จะต้องมีการแจ้งล่วงหน้าอย่างน้อย 24
          ชั่วโมงและอาจต้องมีการตรวจสอบเพิ่มเติม
          เราจะไม่เก็บรายละเอียดการชำระเงินของคุณไว้ในเว็บไซต์ของเรา
          รายละเอียดการชำระเงินทั้งหมดจะถูกจัดเก็บและประมวลผลบนเซิร์ฟเวอร์ SSL
          ที่ปลอดภัยโดยผู้ให้บริการชำระเงินของเราซึ่งมีใบรับรอง PCI-DSS
          ที่ถูกต้อง เงินตรา ธุรกรรมทางการเงินทั้งหมด
          (รวมถึงเงินฝากการถอนการเดิมพันและการจ่ายเงิน) ดำเนินการผ่าน BOXZA
          จะเป็นเงินไทยบาท ระเบียบว่าด้วยการต่อต้านการฟอกเงิน
          ตามที่กำหนดไว้ในข้อบังคับการต่อต้านการฟอกเงินเราขอสงวนสิทธิ์ในการสอบถามเกี่ยวกับธุรกรรมทางการเงินของคุณในเว็บไซต์รวมถึง
          (ไม่ จำกัด เพียง)
          แหล่งที่มาของเงินทุนที่ฝากในบัญชีผู้ใช้ของคุณและบัญชีปลายทางของการถอน
          บัญชีของคุณอาจถูกระงับหรือปิดหากคุณไม่ได้ให้หลักฐานที่เพียงพอของแหล่งเงินทุนที่คุณฝากกับเราหากถูกถาม
          การสื่อสารประกาศและประกาศจาก BOXZA ไปยังผู้ใช้
          มีหลายวิธีในการสื่อสารบนเว็บไซต์และเราพยายามอย่างเต็มที่เพื่อให้ผู้ใช้สื่อสารอย่างน้อยที่สุดหากพวกเขาเลือก
          ประเภทของการสื่อสารที่ผู้ใช้อาจได้รับจากเรารวมถึง:
          คุณตกลงที่จะรับข้อมูลทั้งหมดจากเราทางอิเล็กทรอนิกส์ทางโทรศัพท์ทางอีเมลโดยใช้ที่อยู่อีเมลที่ลงทะเบียนไว้ในบัญชีผู้ใช้ของคุณ
          มันเป็นความรับผิดชอบของคุณในการปรับปรุงรายละเอียดการติดต่อของคุณให้เป็นปัจจุบันในบัญชีผู้ใช้ของคุณ
          หากรายละเอียดเหล่านั้นไม่ถูกต้องหรือไม่เป็นของปัจจุบันคุณอาจไม่ได้รับข้อมูลสำคัญเกี่ยวกับบัญชีผู้ใช้บริการหรือการเปลี่ยนแปลงข้อกำหนดและเงื่อนไขเหล่านี้
          การแจ้งเตือนใด ๆ
          ที่คุณมอบให้เราหรือโดยเราจะถือว่าคุณได้รับและให้บริการอย่างถูกต้องทันทีเมื่อโพสต์บนเว็บไซต์ของเราหรือ
          24 ชั่วโมงหลังจากส่งอีเมล ในการพิสูจน์การแจ้งเตือนใด ๆ
          ก็จะเพียงพอที่จะให้หลักฐานในกรณีของอีเมลว่าอีเมลดังกล่าวถูกส่งไปยังที่อยู่อีเมลที่ระบุของผู้รับ
          บทบัญญัติของวรรคนี้จะไม่ใช้บังคับกับบริการของการดำเนินการใด ๆ
          หรือเอกสารอื่น ๆ ในการดำเนินการทางกฎหมายใด ๆ
          หากเราจำเป็นต้องแจ้งให้คุณทราบโดยตรงภายใต้ข้อกำหนดในการให้บริการเราจะดำเนินการดังกล่าวทางอีเมลไปยังที่อยู่อีเมลที่ลงทะเบียนไว้กับบัญชีผู้ใช้ของคุณ
          กฏเกณฑ์ของหนี้สิน ไม่มีสิ่งใดในข้อกำหนดและเงื่อนไขเหล่านี้ จำกัด
          หรือไม่รวมความรับผิดของเราสำหรับ:
          ·การเสียชีวิตหรือการบาดเจ็บส่วนบุคคลที่เกิดจากความประมาทเลินเล่อของเรา;
          - การฉ้อโกงหรือการหลอกลวงอย่างหลอกลวง และ /
          หรือ·ความรับผิดอื่นใดที่ไม่สามารถยกเว้นหรือ จำกัด
          ตามกฎหมายที่บังคับใช้
          หากเราไม่ปฏิบัติตามข้อกำหนดและเงื่อนไขนี้เราจะยอมรับความรับผิดชอบต่อการสูญเสียหรือความเสียหายที่คุณอาจได้รับซึ่งเป็นผลมาจากการละเมิดหรือการประมาทเลินเล่อของเรา
          แต่ภายใต้สถานการณ์ที่ไม่มี (บันทึกตามที่ระบุไว้ข้างต้น)
          เราจะยอมรับความรับผิดชอบต่อความสูญเสียหรือความเสียหายที่ไม่สามารถคาดการณ์ได้
          (รวมถึงการสูญเสียทางอ้อมการสูญเสียพิเศษหรือผลสืบเนื่อง)
          ความรับผิดทั้งหมดของเราที่มีต่อคุณในส่วนที่เกี่ยวข้องกับการสูญเสียอื่น
          ๆ
          ที่เกิดขึ้นภายใต้หรือเกี่ยวข้องกับข้อกำหนดและเงื่อนไขเหล่านี้บัญชีผู้ใช้ของคุณและการใช้งานเว็บไซต์ของคุณไม่ว่าจะเป็นการทำสัญญาละเมิด
          (รวมถึงความประมาทเลินเล่อ)
          จะต้องไม่เกินจำนวนเงินที่ถืออยู่ในบัญชีผู้ใช้ของคุณในเวลาที่มีการละเมิดดังกล่าว
          เราจะไม่ยอมรับความรับผิดใด ๆ
          สำหรับความล้มเหลวของอุปกรณ์หรือซอฟต์แวร์ใด ๆ
          ที่เกิดขึ้นที่อาจป้องกันการทำงานของเว็บไซต์หรือบริการของเราหรืออาจเป็นอุปสรรคต่อการวางข้อเสนอสำหรับการเดิมพันบนเว็บไซต์หรือป้องกันคุณจากการติดต่อเรา
          ยกเว้นตามที่ระบุไว้อย่างชัดแจ้งในข้อกำหนดในการให้บริการและตามขอบเขตที่กฎหมายอนุญาตเราจะไม่ให้การรับรองการรับประกันหรือการดำเนินการใด
          ๆ ที่เกี่ยวข้องกับการใช้งานเว็บไซต์ของคุณ
          การเป็นตัวแทนเงื่อนไขหรือการรับประกันใด ๆ
          ที่อาจมีการบอกเป็นนัยหรือรวมอยู่ในข้อกำหนดและเงื่อนไขเหล่านี้โดยกฎหมายกฎหมายทั่วไปหรืออื่น
          ๆ จะไม่รวมอยู่ในขอบเขตสูงสุดที่กฎหมายอนุญาต การระงับการให้บริการ
          บริการของเราอาจถูกระงับในบางครั้งด้วยเหตุผลหลายประการซึ่งรวมถึง (ไม่
          จำกัด เฉพาะ): ·เนื่องจากเราทำการบำรุงรักษาที่จำเป็น
          เราจะพยายามเตือนคุณเมื่อเกิดเหตุการณ์เช่นนี้และเราจะพยายาม จำกัด
          ให้อยู่ในช่วงเวลาที่เว็บไซต์มีมีผู้เล่นน้อย
          ·เนื่องจากสถานการณ์ที่อยู่นอกเหนือการควบคุมของเรา
          หากเป็นกรณีนี้เราจะพยายามอย่างดีที่สุดเพื่อแจ้งให้คุณทราบถึงลักษณะและระยะเวลาที่อาจเกิดการสูญเสียบริการ
          ·เนื่องจากเราจำเป็นต้องระงับบริการโดยหน่วยงานกำกับดูแลหรือหน่วยงานอื่นที่เกี่ยวข้อง
          เราจะไม่รับผิดชอบต่อความสูญเสียที่ผู้ใช้อาจได้รับเนื่องจากการระงับบริการ
          สิ่งนี้จะถูกดำเนินการตามดุลยพินิจของ BOXZA
          ซึ่งการตัดสินใจจะขึ้นอยู่กับการทำให้มั่นใจว่าไม่มีลูกค้าเสียเปรียบ
          BOXZA มุ่งมั่นที่จะแจ้งให้คุณทราบถึงการหยุดชะงักหลัก ๆ ของบริการของเรา
          การร้องเรียนและข้อพิพาท
          เราจะพยายามจัดการกับผู้ใช้ทุกคนอย่างยุติธรรมตลอดเวลา
          แต่หากคุณมีข้อร้องเรียนโปรดติดต่อเรา: support@boxza.co.th
          หรือคุณสามารถติดต่อเราโดยตรงบนเว็บไซต์ของเราในส่วนการสนับสนุนของเราและเราจะพยายามแก้ไขปัญหาของคุณ
          (s) อย่างรวดเร็วและเป็นธรรม
          ในอีเมลถึงเราโปรดระบุชื่อผู้ใช้และชื่อเต็มของคุณและตรวจสอบให้แน่ใจว่าที่อยู่อีเมลที่คุณใช้เป็นที่อยู่ที่คุณได้ลงทะเบียนไว้ในบัญชีผู้ใช้ของคุณ
          โปรดระบุคำอธิบายที่ชัดเจนเกี่ยวกับการร้องเรียนของคุณ ทีม BOXZA
          จะตรวจสอบการร้องเรียนของคุณและตอบกลับคุณโดยเร็วที่สุด
          ทรัพย์สินทางปัญญา สิทธิ์ในทรัพย์สินทางปัญญาทั้งหมดบนเว็บไซต์รวมถึง
          แต่ไม่ จำกัด
          เพียงแค่ลิขสิทธิ์และสิทธิ์ที่เกี่ยวข้องสิทธิ์ในการออกแบบและสิทธิ์เครื่องหมายการค้าทั้งหมด
          (ไม่ว่าจะลงทะเบียนหรือไม่ได้ลงทะเบียน)
          ในและไปยังเว็บไซต์ซอฟต์แวร์ภาพและข้อความและชื่อโดเมน http: // www
          .boxza.co.th (รวมถึง "สิทธิ์ในทรัพย์สินทางปัญญา") จะเป็นของเราตลอดเวลา
          ภายใต้เงื่อนไขของใบอนุญาตที่ได้รับภายใต้ข้อกำหนดและเงื่อนไขเหล่านี้ผู้ใช้จะได้รับอนุญาตให้ใช้เว็บไซต์ตามที่ได้รับอนุญาตอย่างชัดแจ้งจากเราเท่านั้น
          คุณตกลงที่จะไม่คัดลอกแจกจ่ายเผยแพร่ทำซ้ำส่งต่อแสดงผลใช้ประโยชน์ในเชิงพาณิชย์ยุ่งเกี่ยวกับหรือสร้างผลงานลอกเลียนแบบของสิทธิ์
          IP ใด ๆ
          ทั้งหมดหรือบางส่วนและคุณตกลงที่จะไม่แทรกแซงแก้ไขหรือทำวิศวกรรมซอฟต์แวร์ใด
          ๆ ให้ไว้บนเว็บไซต์ คุณรับทราบและตกลงว่าเนื้อหา
          และเนื้อหาที่อยู่ในเว็บไซต์และจัดให้เป็นส่วนหนึ่งของบริการนั้นมีไว้สำหรับการใช้งานส่วนตัวที่ไม่ใช่เชิงพาณิชย์เท่านั้น
          ห้ามมิให้มีการใช้เนื้อหาและเนื้อหาดังกล่าวในลักษณะอื่น
          ข้อกำหนดทั่วไปการแก้ไขข้อกำหนดและเงื่อนไขเหล่านี้ BOXZA
          ขอสงวนสิทธิ์ในการเปลี่ยนแปลงข้อตกลงและเงื่อนไขเพื่อสะท้อนการเปลี่ยนแปลงในเว็บไซต์และ
          /
          หรือบริการรวมถึงการเพิ่มผลิตภัณฑ์หรือบริการที่เราหรือบุคคลที่สามนำเสนอ
          เราจะประกาศและเผยแพร่การเปลี่ยนแปลงใด ๆ
          บนเว็บไซต์และเราจะแจ้งให้คุณทราบล่วงหน้า
          (โดยเราจะทำการส่งอีเมลถึงคุณตามดุลยพินิจของคุณและให้การแจ้งเตือนบนเว็บไซต์หรือเผยแพร่ประกาศและข้อกำหนดและเงื่อนไขที่แก้ไขบนเว็บไซต์)
          การที่คุณยังคงใช้งานเว็บไซต์และบริการต่อไปหลังจากการแจ้งเตือนดังกล่าวหรือการแจ้งเตือนล่วงหน้าดังกล่าวจะถือว่าเป็นการยอมรับการเปลี่ยนแปลงดังกล่าว
          หากการเปลี่ยนแปลงไม่สามารถยอมรับได้คุณไม่ควรใช้เว็บไซต์และ /
          หรือบริการต่อไป เป็นความรับผิดชอบของคุณ
          แต่เพียงผู้เดียวในการตรวจสอบข้อกำหนดและเงื่อนไข (รวมถึงกฎ)
          และการแก้ไขใด ๆ ที่เกิดขึ้นในแต่ละครั้งที่คุณใช้เว็บไซต์และ /
          หรือบริการ
          ความถูกต้องและการบังคับใช้ของบทบัญญัติที่เหลืออยู่ของข้อกำหนดและเงื่อนไขเหล่านี้จะไม่ได้รับผลกระทบ
          การมอบหมาย
          คุณไม่สามารถกำหนดข้อตกลงและเงื่อนไขเหล่านี้ให้กับบุคคลที่สามใด ๆ
          เราอาจมอบหมายโอนหรือเริ่มต้นสิทธิและภาระผูกพันใด ๆ
          หรือทั้งหมดภายใต้ข้อกำหนดและเงื่อนไขเหล่านี้ให้กับบุคคลที่สามในเวลาใดก็ได้โดยไม่ต้องแจ้งให้คุณทราบ
          สิทธิของเรา แม้จะมีข้อกำหนดอื่น ๆ
          ที่กำหนดไว้ในข้อกำหนดและเงื่อนไขเหล่านี้ในการให้บริการเราจะมีสิทธิ์ดำเนินการตามที่เราพิจารณาถึงความจำเป็นตามดุลยพินิจของเราเพื่อให้มั่นใจว่าสอดคล้องกับกฎหมายที่ใช้บังคับทั้งหมด
          การปรับปรุงข้อกำหนดและเงื่อนไขครั้งล่าสุด:08.08.2019 การคืนเงิน
          เราให้เงินคืนเต็มจำนวนเท่านั้นหากคุณพบข้อผิดพลาดที่ทำให้คุณไม่สามารถใช้งานเว็บไซต์ของเราได้ตามปกติและหากเราไม่สามารถแก้ไขข้อผิดพลาดภายในระยะเวลาที่ยอมรับได้หรือเสนอวิธีแก้ปัญหาชั่วคราวให้คุณ
          โปรดทราบ! การคืนเงินเป็นไปได้เฉพาะเมื่อมีการร้องขอจากทีมสนับสนุนของเรา
          คุณให้ข้อมูลโดยละเอียดเกี่ยวกับข้อผิดพลาดดังต่อไปนี้:
          ภาพหน้าจอของข้อความแสดงข้อผิดพลาดไฟล์บันทึกคำอธิบายโดยละเอียดของการกระทำตัวอย่างไฟล์
          ฯลฯ หากต้องการขอรับเงินคืนโปรดติดต่อฝ่ายสนับสนุนของเราที่
          support@boxza.co.th และแจ้งข้อมูลโดยละเอียดเกี่ยวกับปัญหาของคุณ
          โดยปกติจะใช้เวลาสองสามวันทำการในการประมวลผลคำขอของคุณ
          เราจะคืนเงินให้กับการชำระเงินของคุณในแบบเดียวกับที่คุณชำระเงินด้วย
          เราขอสงวนสิทธิ์ในการยกเลิกการขอรับเงินคืน:
          ·หากผู้ใช้ขอรับเงินคืนทันทีหลังจากซื้อ
          ·หากผู้ใช้แจ้งให้เราทราบเกี่ยวกับการเปลี่ยนแปลงการตัดสินใจของเขาเกี่ยวกับการซื้อโดยไม่ให้เหตุผลใด
          ๆ ·หากผู้ใช้สงสัยว่ามีกิจกรรมฉ้อโกงใน BOXZA.co.th การจัดส่งสินค้า
          หากคุณไม่ได้ทำการขายสินค้าคืนให้กับเวปไซต์
          คุณมีหน้าที่ต้องให้ข้อมูลต่อไปนี้แก่เรา 1. ชื่อเต็ม 2. ที่อยู่ 3.
          รหัสไปรษณีย์ชื่อเมืองและประเทศ
          เมื่อคุณได้ทำแล้วคุณจะต้องเห็นด้วยกับข้อตกลงและเงื่อนไขของเรา
          พนักงานของ BOXZA จะส่งรางวัลที่คุณได้รับ ค่าจัดส่งเท่าไร
          เพื่อประโยชน์ของผู้ใช้ของเราเราพยายามค้นหาสินค้าที่มีการจัดส่งระหว่างประเทศและไม่มีค่าธรรมเนียมในการจัดส่ง
          คุณขึ้นอยู่กับสถานการณ์ตลาดและรายการที่คุณรวบรวมอาจมีปัญหา
          หากด้วยเหตุผลใดก็ตามผู้ผลิตจะไม่ทำการจัดส่งไปยังประเทศของคุณคุณจะได้รับเงินคืนเต็มจำนวนตามมูลค่าของรายการ
          หากประเทศที่คุณอาศัยอยู่มีความต้องการที่จะจ่ายภาษีในรายการคุณมีหน้าที่ต้องทำเช่นนั้น
          เราแนะนำให้คุณตรวจสอบกฎระเบียบด้านภาษีสำหรับคำสั่งซื้อออนไลน์ในประเทศของคุณก่อนที่จะตัดสินใจขายหรือรับรางวัลของคุณ
          หากคุณต้องการรับสินค้าที่คุณชนะและ BOXZA
          ซื้อให้คุณหากจำเป็นคุณจะต้องจ่ายค่าธรรมเนียมตามการขนส่งและภาษี
          เพื่อป้องกันสแปมที่อาจเกิดขึ้นจากการจัดส่งสินค้าราคาถูกเราได้กำหนดค่าธรรมเนียมการจัดส่ง
          50 ถึง 300 บาทขึ้นอยู่กับต้นทุนขนาดและน้ำหนักของรายการ
          ก่อนที่คุณจะยืนยันการสั่งซื้อจำนวนค่าจัดส่งจะปรากฏขึ้นโดยอัตโนมัติและหักจากกระเป๋าเงิน
          BOXZA ของคุณ หากเงินเหล่านี้จะไม่เพียงพอคุณจะต้องเพิ่ม
          คุณสามารถจัดส่งสินค้าได้ครั้งละกี่รายการ? มากเท่าที่คุณต้องการ
          แต่คุณจะต้องจ่ายค่าธรรมเนียมแยกต่างหากสำหรับทุกรายการที่ระบุไว้
          ฉันจะได้รับการจัดส่งเมื่อไหร่? โดยปกติจะใช้เวลา 3 ถึง 7
          วันจนกว่าคุณจะได้รับสินค้าตามที่อยู่ของคุณ การป้องกันการฉ้อโกง / AML
          ในฐานะที่เป็นส่วนหนึ่งของการป้องกันการฉ้อโกง / AML
          ของเราเราสามารถขอให้คุณส่งเอกสารและการตรวจสอบเพิ่มเติมเพื่อการส่งมอบในกรณีที่มีกิจกรรมที่น่าสงสัย
          การส่งมอบอาจถูกระงับหากเราจำเป็นต้องตรวจสอบความถูกต้องของเงินทุนบุคคลหรือเอกสารของคุณการใช้เว็บไซต์ของเราลูกค้าตกลงที่จะร่วมมือและให้บริการเอกสารตามระยะเวลาที่เหมาะสม
          ศุลกากรและภาษี พันธมิตรของเราส่งรายการเป็น "การซื้ออีคอมเมิร์ซ"
          ลูกค้าตกลงที่จะแก้ไขปัญหาศุลกากรหากเกิดขึ้นและจ่ายภาษีที่จำเป็นสำหรับรายการ
          หากคุณมีความต้องการพิเศษสำหรับการจัดส่ง
          (เหตุผลค่าใช้จ่ายใบแจ้งหนี้สถานะ“ ใช้แล้ว” ประกัน ฯลฯ )
          โปรดแจ้งให้เราทราบก่อนที่คุณจะทำการสั่งซื้อ
          เราไม่สามารถตอบสนองพวกเขาหากมีการดำเนินการตามคำสั่งของพันธมิตร คำถามใด
          ๆ อย่าลังเลที่จะถามเรา: support@boxza.co.th
        </v-card-text>
      </v-card>
    </v-dialog>
  </v-row>
</template>

<script>
export default {
  name: "conditionsModal",
  data() {
    return {
      conditionsDialog: true
    };
  },
  watch: {
    conditionsDialog() {
      const vm = this;
      vm.$emit("conditionsDialog", vm.conditionsDialog);
    }
  }
};
</script>

<style lang="scss" scoped>
#conditionsModal {
  position: relative;
  border-radius: 15px;
  box-shadow: 0px 11px 15px -7px rgba(0, 0, 0, 0.2),
    0px 24px 38px 3px rgba(0, 0, 0, 0.14), 0px 9px 46px 8px rgba(0, 0, 0, 0.12);
  .close-icon {
    text-align: right;
    padding: 20px 22px 0px 22px;
    margin-right: 5px;
    .icon {
      cursor: pointer;
      color: #cfcfcf;
      font-size: 30px;
    }
  }
}
</style>
